Revit 2024 API
BuiltInFailures.SketchFailures.StairRiserDoesntIntersectBoundary Property
 The line representing the top of a riser does not intersect one or both of the boundary lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairRiserDoesntIntersectBoundary { get; }
Visual Basic
Public Shared ReadOnly Property StairRiserDoesntIntersectBoundary As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairRiserDoesntIntersectBoundary {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace